#include <iostream>  // Оролт, гаралттай ажиллах номын санг оруулж байна
using namespace std;  // std нэртэй санг ашиглах болно

int main() {
    int a, b, c;  // гурван хувьсагчийг зарлаж байна, эдгээр нь гурвалжны гурван талын урт

    cin >> a >> b >> c;  // Хэрэглэгчээс гурван тоо оруулахыг хүснэ (гурвалжны гурван тал)

    // Шалгах нөхцөл: гурвалжин үүсэх боломжтой эсэх
    if (a + b > c && a + c > b && b + c > a) {
        // Хэрвээ гурвалжин үүсэх боломжтой бол "YES" хэвлэнэ
        cout << "YES" << endl;
    } else {
        // Хэрвээ гурвалжин үүсэх боломжгүй бол "NO" хэвлэнэ
        cout << "NO" << endl;
    }

    return 0;  // Программыг амжилттай дуусгалаа гэдгийг илэрхийлж байна
}
