n = int(input())         # Оролт: хэдэн хүн байгаа (нийт элементүүдийн тоо)
sol = [0, 0, 0, 0]       # 1, 2, 3, 4 хүнтэй багуудын тоог хадгалах массив

for _ in range(n):
    number = int(input())
    sol[number - 1] += 1  # 1-ийг 0-р индекст, 2-г 1-р индекст гэх мэт хадгална

result = 0

# 3 хүнтэйг 1 хүнтэй хослуулна
pair_3_and_1 = min(sol[2], sol[0])
result += pair_3_and_1
sol[2] -= pair_3_and_1
sol[0] -= pair_3_and_1

# Үлдсэн 3 хүнтэйг тусдаа таксинд
result += sol[2]

# 2 хүнтэй багууд
result += sol[1] // 2
if sol[1] % 2 == 1:
    result += 1  # сондгой тооны 2 хүнтэй баг үлдвэл
    sol[0] = max(0, sol[0] - 2)  # түүн дээр 2 ширхэг 1-ийг нэмээд баг бүрдүүлнэ

# 4 хүнтэй багууд
result += sol[3]

# Үлдсэн 1 хүнтэй багууд
result += sol[0] // 4
if sol[0] % 4 != 0:
    result += 1

print(result)
