#include <iostream>  // Оролт, гаралтын урьдчилсан тодорхойлолт

using namespace std;

int main() {
    int a, b;                  // 'a' ба 'b' нэртэй бүхэл тооны хувьсагч зарлаж байна
    cin >> a;                  // Хэрэглэгчээс 'a' хувьсагчид утга авна
    cin >> b;                  // Хэрэглэгчээс 'b' хувьсагчид утга авна
    cout << a + b << endl;     // 'a' ба 'b'-г нэмээд, хариуг дэлгэцэнд хэвлэнэ

    return 0;                  // Программыг амжилттай дуусгаж байгааг илэрхийлнэ
}
